//Напишите программу, которая на вход принимает два целых числа
// и проверяет, является ли первое число квадратом второго.

// Console.Write("Введите первое число: ");
// int number1 = Console.ReadLine();
// // int.Parse("cczczczxc");
// // Convert.ToInt32("1125546");
// Console.Write("Введите второе число: ");
// int number2 = Console.ReadLine();

// if (number1 == number2 * number2)
// {
//     Console.WriteLine("Да");
// }
// else
// {
//     Console.WriteLine("Нет");
// }

